####################################################################################################
### Повторение
# Напишите программу которая считывает строку с клавиатуры, а затем сразу печатает ее.
# Входные данные: С клавиатуры вводится одна строка.
# Выходные данные: Выводится одна строка.
# Sample Input 1:
# ау
# Sample Output 1:
# ау
####################################################################################################

text = input()
print(text)

#################

print(input())


