####################################################################################################
# Приглашение
# Напишите программу, которая будет выводить приглашение.
# Входные данные: С клавиатуры вводится три строки: Имя
#                                                   Событие
# Выходные данные:                                  Место
# Выводится 2 строки, все пробелы и знаки препинания должны стоять как в примере:
# Дорогой {Имя} !
# Приглашаем вас на {Событие} , который состоится в {Место} !
# Sample Input: Иванов Иван
#               юбилей
#               ДК Агрегатный
# Sample Output: 
# Дорогой Иванов Иван !
# Приглашаем вас на юбилей , который состоится в ДК Агрегатный !
####################################################################################################








##################################################



##################################################



#################################################



#################################################



#################################################



#################################################



################################################



###############################################



################################################



################################################



###############################################




