####################################################################################################
### Повторение х 3 наоборот
# Напишите программу, которая считывает 3 строки с клавиатуры, а затем выводит их в обратном порядке.
# Входные данные: С клавиатуры вводится три строки.
# Выходные данные: Выводится три строки.
# Sample Input 1: ау            Sample Output 1: кто
#                 ты                             ты
#                 кто                            ау 
####################################################################################################

text_1 = input()
text_2 = input()
text_3 = input()
print(text_3)
print(text_2)
print(text_1)

#######################################################

a = input(); b = input(); c = input()
print (c)
print (b)
print (a)

########################################################

a, b, c = input(), input(), input()
print(c, b, a, sep='\n')    # sep- контролирует то, какой разделитель будет использоваться между элементами. По умолчанию используется пробел:

########################################################

a, b, c = [input() for i in range(3)]
print(c,b,a, sep = '\n')

########################################################

print(*reversed([input() for _ in range(3)]), sep='\n') # 'reversed' - переворот строки с обратной итерацией

#######################################################

print(*[input(),input(),input()][::-1], sep='\n') # срез последовательности с [::-1] создает перевернутую копию

##########################################################

# [print(s) for s in reversed([input() for _ in range(3)])]

# ############################################################

# lst = [input() for _ in range(3)]
# print(*lst[::-1], sep='\n')

# ############################################################

# strings = [input() for _ in range(3)]
# strings.reverse()
# [print(i) for i in strings]

# ##############################################################

# a, b, c = input(), input(), input()
# print('{2} \n{1} \n{0}'.format(a, b, c))
