####################################################################################################
### Официант
# Напишите программу, которая берет у пользователя заказ и затем повторяет его.
# Входные данные: С клавиатуры Вводится три строки: Блюдо   -  Стейк филе миньон
#                                                   Напиток -  Компот
#                                                   Десерт  -  Чизкейк
# # Выходные данные: Выводится 6 строк, все пробелы и знаки препинания должны стоять как в примере:
# Здравствуйте, что будете заказывать?
# Отлично, что будете пить?
# Что принести на десерт?
# {Блюдо} будет через 15-20 минут.
# На десерт будет {Десерт} и {Напиток} через 25 минут.
# Приятного аппетита.
####################################################################################################



##################################################



##################################################



#################################################



#################################################



#################################################



#################################################



################################################



###############################################



################################################



################################################



###############################################




