####################################################################################################
### Две фразы
# Напишите программу, которая выводит 2 фразы пользователя по три раза.
# Входные данные: С клавиатуры Вводится 2 строки.
# Выходные данные: Выводится 6 строк.
# Sample Input:   Ау              Sample Output:  Ау
#                 Кто-там?                        Ау
#                                                 Ау
#                                                 Кто-там?
#                                                 Кто-там?
#                                                 Кто-там?       
####################################################################################################

a, b = input(), input()
print(a,a,a,b,b,b, sep='\n')

#################################################

a,b = input(),input()
print(f'{a}\n'*3, f'{b}\n'*3, sep ='')

##################################################

print(f'{input()}\n' * 3, f'{input()}\n' * 3, sep='')

################################################

print ((input () + "\n")*3+(input () + "\n")*3)

##################################################

print(*[input()] * 3, *[input()] * 3, sep='\n')

#################################################
 
print(*[input()] * 3 + [input()] * 3, sep='\n')

#################################################

[print(*[s]*3,sep='\n') for s in (input() for _ in range(2))]

#################################################